#SQL
Cada vez se vuelve más indispensable interactuar con bases de datos, especialmente cuando se trabaja con grandes volúmenes de información estructurada. Para ello, uno de los lenguajes más utilizados en la industria es SQL (Structured Query Language).

En este cuaderno se abordan algunos comandos SQL que se practicarán a través de ejemplos simples y claros empleando la librería sqlite3 de Python.

Por:

Ferney Orlando Amaya Fernández

#1 Crear la base de datos

Para la siguiente tabla de ejemplo se presenta el uso de las sentencias básicas de SQL empleando SQLite3.

| id | nombre       | cargo         | salario | departamento |
|----|--------------|---------------|---------|--------------|
| 1  | Ana Torres   | Analista      | 4000    | Finanzas     |
| 2  | Luis Pérez   | Desarrollador | 4500    | Tecnología   |
| 3  | Marta Gómez  | Gerente       | 6000    | Ventas       |
| 4  | Diego Ríos   | Desarrollador | 4700    | Tecnología   |

## Crear la conexión en SQLite3


Inicialmente, se importan las bibliotecas:

In [2]:
import sqlite3

Posteriormente se realiza la conexión a la base de datos. Con la opción en memoria, el código se ejecuta en memoria, por lo que todos los datos se pierden cuando termina el script.

```
sqlite3.connect(':memory:')
```

En este ejemplo se guardarán los datos en un archivo llamado `empleados.db`.

In [3]:
conn = sqlite3.connect('empleados.db')
cursor = conn.cursor()

## Crear la tabla
Se crea la tabla:

In [4]:
cursor.execute("""
CREATE TABLE empleados (
    id INTEGER PRIMARY KEY,
    nombre TEXT,
    cargo TEXT,
    salario REAL,
    departamento TEXT
);
""")

## Mostrar información de las columnas

Para mostrar información de las columnas de la tabla empleados:

In [5]:
cursor.execute("PRAGMA table_info(empleados);")
resultados = cursor.fetchall()
print("Nombre de la columna | Tipo de dato | NOT NULL | Clave Primaria | Valor por defecto")
print("-----------------------------------------------------------------------")
for fila in resultados:
    print(f"{fila[1]:<20} | {fila[2]:<12} | {fila[3]:<8} | {fila[5]:<14} | {fila[4]}")
    #print(fila)

Nombre de la columna | Tipo de dato | NOT NULL | Clave Primaria | Valor por defecto
-----------------------------------------------------------------------
id                   | INTEGER      | 0        | 1              | None
nombre               | TEXT         | 0        | 0              | None
cargo                | TEXT         | 0        | 0              | None
salario              | REAL         | 0        | 0              | None
departamento         | TEXT         | 0        | 0              | None

## Consultar tablas existentes y borrar tablas de un archivo

Con el siguiente código pueden observarse las tablas creadas dentro del archivo `empleados.db`.

In [ ]:
# Consultar las tablas existentes
cursor.execute("SELECT name FROM sqlite_master WHERE type='table';")
tablas = cursor.fetchall()

# Mostrar las tablas
for tabla in tablas:
    print(tabla[0])

empleados

Para borrar la tabla se emplea:

In [ ]:
cursor.execute("DROP TABLE IF EXISTS empleados;")

##Insertar los datos iniciales

In [ ]:
cursor.execute("""
INSERT INTO empleados (id, nombre, cargo, salario, departamento)
VALUES
    (1, 'Ana Torres', 'Analista', 4000, 'Finanzas'),
    (2, 'Luis Pérez', 'Desarrollador', 4500, 'Tecnología'),
    (3, 'Marta Gómez', 'Gerente', 6000, 'Ventas'),
    (4, 'Diego Ríos', 'Desarrollador', 4700, 'Tecnología')
""")

##Consultar los datos

Consultar todos los datos:

In [ ]:
print("Todos los empleados:")
cursor.execute("SELECT * FROM empleados;")
for fila in cursor.fetchall():
    print(fila)

Todos los empleados:
(1, 'Ana Torres', 'Analista', 4000.0, 'Finanzas')
(2, 'Luis Pérez', 'Desarrollador', 4500.0, 'Tecnología')
(3, 'Marta Gómez', 'Gerente', 6000.0, 'Ventas')
(4, 'Diego Ríos', 'Desarrollador', 4700.0, 'Tecnología')

#2 Comandos básicos

## Insertar datos

Para insertar un registro:

In [ ]:
cursor.execute("""
INSERT INTO empleados (id, nombre, cargo, salario, departamento)
VALUES (5, 'Laura Jiménez', 'Analista', 4200, 'Marketing');
""")

##Modificar un registro existente
Se aumentará el salario solo de los que tienen el cargo Desarrollador en 300:

In [ ]:
cursor.execute("""
UPDATE empleados
SET salario = salario + 300
WHERE cargo = 'Desarrollador';
""")

##Eliminar registros
Se eliminará el registro con id=3:

In [ ]:
cursor.execute("""
DELETE FROM empleados
WHERE id = 3;
""")

##Observar el resultado:

In [ ]:
print("Todos los empleados:")
cursor.execute("SELECT * FROM empleados;")
for fila in cursor.fetchall():
    print(fila)

Todos los empleados:
(1, 'Ana Torres', 'Analista', 4000.0, 'Finanzas')
(2, 'Luis Pérez', 'Desarrollador', 4800.0, 'Tecnología')
(4, 'Diego Ríos', 'Desarrollador', 5000.0, 'Tecnología')
(5, 'Laura Jiménez', 'Analista', 4200.0, 'Marketing')

#3 Consultar datos

##Filtrar por un valor específico:

In [ ]:
cursor.execute("""
SELECT * FROM empleados
WHERE departamento = 'Tecnología';
""")
for fila in cursor.fetchall():
    print(fila)

(2, 'Luis Pérez', 'Desarrollador', 4800.0, 'Tecnología')
(4, 'Diego Ríos', 'Desarrollador', 5000.0, 'Tecnología')

##Obtener nombre y salario solo de los desarrolladores:

In [ ]:
cursor.execute("""
SELECT nombre, salario
FROM empleados
WHERE cargo = 'Desarrollador';
""")
for fila in cursor.fetchall():
    print(fila)

('Luis Pérez', 4800.0)
('Diego Ríos', 5000.0)

##Filtrar con operadores relacionales:

In [ ]:
cursor.execute("""
SELECT nombre, salario
FROM empleados
WHERE salario > 3000;
""")
for fila in cursor.fetchall():
    print(fila)

('Ana Torres', 4000.0)
('Luis Pérez', 4800.0)
('Diego Ríos', 5000.0)
('Laura Jiménez', 4200.0)

##Usar múltiples condiciones con AND / OR

In [ ]:
cursor.execute("""
SELECT nombre, salario
FROM empleados
WHERE cargo = 'Analista' AND salario > 4000;
""")
for fila in cursor.fetchall():
    print(fila)

('Laura Jiménez', 4200.0)

##Búsqueda por patrón

In [ ]:
cursor.execute("""
SELECT nombre
FROM empleados
WHERE nombre LIKE 'A%';
""")
for fila in cursor.fetchall():
    print(fila)

('Ana Torres',)

##Varios valores posibles

In [ ]:
cursor.execute("""
SELECT nombre
FROM empleados
WHERE departamento IN ('Ventas', 'Tecnología');
""")
for fila in cursor.fetchall():
    print(fila)

('Luis Pérez',)
('Diego Ríos',)

##Rango de valores

In [ ]:
cursor.execute("""
SELECT nombre
FROM empleados
WHERE salario BETWEEN 4000 AND 5000;
""")
for fila in cursor.fetchall():
    print(fila)

('Ana Torres',)
('Luis Pérez',)
('Diego Ríos',)
('Laura Jiménez',)

##Verificar nulos	SELECT nombre

In [ ]:
cursor.execute("""
SELECT nombre
FROM empleados
WHERE salario IS NULL;
""")
for fila in cursor.fetchall():
    print(fila)

#4 Finalización

##Guardar cambios si se hicieron modificaciones.

In [ ]:
conn.commit()

##Cerrar la conexión

In [ ]:
conn.close()

##Descargar el archivo

Para descargar el archivo empleados.db al computador:

In [ ]:
from google.colab import files
files.download('empleados.db')

#5 Ejercicios

##5.1 Ejercicio 1

In [ ]:
"Información de empleados en una empresa"
CREATE TABLE prueba1 (
    id INTEGER PRIMARY KEY AUTOINCREMENT,
    nombre TEXT NOT NULL,
    edad INTEGER,
    departamento TEXT,
    salario REAL,
    fecha_ingreso TEXT,
    telefono TEXT
);

INSERT INTO prueba1 (nombre, edad, departamento, salario, fecha_ingreso, telefono) VALUES
('Ana Torres',        28, 'Ventas',    3200.50, '2021-05-10', '3001234567'),
('Luis Pérez',        35, 'Marketing', 4100.00, '2020-08-21', NULL),
('María López',       42, 'Ventas',    3900.75, '2018-11-15', '3129876543'),
('Pedro Gómez',       30, 'IT',        5000.00, '2019-01-10', '3155555555'),
('Laura Sánchez',     25, 'Ventas',    2800.00, '2022-07-01', NULL),
('Andrés Castro',     38, 'IT',        5400.00, '2017-09-30', '3012223344'),
('Inés Ramírez',      29, 'Marketing', 3600.50, '2021-02-18', '3144445566'),
('Carlos Martínez',   45, 'Gerencia',  7500.00, '2015-03-12', '3166667788'),
('Elena Gutiérrez',   33, 'IT',        4900.00, '2020-12-05', NULL),
('Andrés López',      27, 'Ventas',    3000.00, '2023-01-25', '3009998888');

## Ejercicio 2

In [ ]:
-- Crear tabla Clientes
CREATE TABLE Clientes (
    cliente_id INTEGER PRIMARY KEY,
    nombre TEXT NOT NULL,
    ciudad TEXT
);

-- Insertar registros en Clientes
INSERT INTO Clientes (cliente_id, nombre, ciudad) VALUES
(1, 'Ana Pérez', 'Bogotá'),
(2, 'Luis Gómez', 'Medellín'),
(3, 'Carlos Ruiz', 'Cali'),
(4, 'Laura Torres', 'Bogotá');

-- Crear tabla Órdenes
CREATE TABLE Ordenes (
    orden_id INTEGER PRIMARY KEY,
    cliente_id INTEGER,
    fecha TEXT,
    total REAL,
    FOREIGN KEY (cliente_id) REFERENCES Clientes(cliente_id)
);

-- Insertar registros en Órdenes
INSERT INTO Ordenes (orden_id, cliente_id, fecha, total) VALUES
(101, 1, '2024-05-10', 150),
(102, 2, '2024-05-11', 200),
(103, 1, '2024-05-12', 300),
(104, 3, '2024-05-13', 100),
(105, 2, '2024-05-14', 250);